In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame(columns=["Name", "Height", "Age"])

In [3]:
df

Empty DataFrame
Columns: [Name, Height, Age]
Index: []

In [4]:
df.loc[0] = ["Allen", 175, 25]
df

    Name  Height  Age
0  Allen     175   25

In [5]:
df["Weight"] = [75]

In [6]:
df

    Name  Height  Age  Weight
0  Allen     175   25      75

In [8]:
df.drop("Weight", axis=1)

    Name  Height  Age
0  Allen     175   25

In [9]:
df

    Name  Height  Age  Weight
0  Allen     175   25      75

In [10]:
df = df.drop("Weight", axis=1)
df

    Name  Height  Age
0  Allen     175   25

In [11]:
df.drop(0)

Empty DataFrame
Columns: [Name, Height, Age]
Index: []

In [12]:
df

    Name  Height  Age
0  Allen     175   25

In [13]:
df = df.drop(0)

In [14]:
df

Empty DataFrame
Columns: [Name, Height, Age]
Index: []

In [15]:
data = [
    ["Allen", 175, 75],
    ["Ted", 180, 85],
    ["Jack", 188, 77],
]
columns = ["Name", "Height", "Age"]

df = pd.DataFrame(
    data=data,
    columns=columns,
)

df

    Name  Height  Age
0  Allen     175   75
1    Ted     180   85
2   Jack     188   77

In [16]:
df["Age"]

0    75
1    85
2    77
Name: Age, dtype: int64

In [17]:
df["Age"][0] = 30
df

/tmp/ipykernel_14193/2990639814.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["Age"][0] = 30

    Name  Height  Age
0  Allen     175   30
1    Ted     180   85
2   Jack     188   77

In [18]:
data = [
    ["Lucy", 175, 75],
    ["Trump", 180, 85],
    ["Rose", 188, 77],
]
columns = ["Name", "Height", "Age"]

df2 = pd.DataFrame(
    data=data,
    columns=columns,
)

df2

    Name  Height  Age
0   Lucy     175   75
1  Trump     180   85
2   Rose     188   77

In [19]:
pd.concat([df, df2])

    Name  Height  Age
0  Allen     175   30
1    Ted     180   85
2   Jack     188   77
0   Lucy     175   75
1  Trump     180   85
2   Rose     188   77

In [20]:
df3 = pd.concat([df, df2])
df3

    Name  Height  Age
0  Allen     175   30
1    Ted     180   85
2   Jack     188   77
0   Lucy     175   75
1  Trump     180   85
2   Rose     188   77

In [23]:
df3 = df3.reset_index(drop=True)
df3

    Name  Height  Age
0  Allen     175   30
1    Ted     180   85
2   Jack     188   77
3   Lucy     175   75
4  Trump     180   85
5   Rose     188   77